// 자료형(Data Type)이란 무엇인가?
// 이번 강좌에서는 자료형의 개념에 대해서 학습합니다.


// [1] : 자료형
// 백과사전식 정의 --> 프로그래밍 언어에서 숫자, 문자 등 여러 종류의 데이터를 구분하는 분류 체계.
// 쉽게 말해서, 변수의 종류 또는 변수의 저장되는 값의 형태(종류).


// [2] : 일상의 예로 설명하면
// 어느 바닷가에 갔더니 거기에는 잘 잡히는 물고기 종류가 4가지 정도 있다고 한다. --> 그럼 뭐다 --> 데이터(물고기) 종류가 4가지다.
// 프로그래밍 언어마다 이런 데이터 형태(종류)를 몇 개로 나눌 것인지는 거의 비슷하지만 약간씩 다르다.
// 시간이 지나면서 새로운 형태(종류)의 필요성이 느껴지면 새로운 데이터타입을 추가할 수도 있다. --> 심볼(Symbol) 


// [3] : 자바스크립트 자료형 종류
// 원시 타입 vs 참조 타입
// 기본형 vs 참조형


// [4] : 기본형 타입(Primitive Type) --> 값을 그대로 셋팅(할당)
// 숫자형			--> Number
// 문자(열)형			--> String
// 불리언			--> Boolean
// 널				--> null
// 언디파인드		--> undefined
// 심볼				--> Symbol


// [5] : 참조형 타입(Reference Type) --> 값이 저장된 주소값을 셋팅(할당)
// 객체				--> Object
// 배열				--> Array
// 함수				--> Function
// 맵				--> Map
// 셋				--> Set


















